# Вводим переменные
txt = str(input("Введите текст в котором осуществляется поиск: "))
ps = str(input("Введите искомую подстроку: "))

# Задаем переменную с конечным результатом, на случай если подстрока не найдется
result = -1

# Перебираем все символы в исходном тексте, начиная с нулевого по конечный минус длина искомой подстроки
# (длина подстроки - 1) для учета того что индесы символов начинаются с 0
for x in range(len(txt) - (len(ps) - 1)):
    # определяем индекс последнего символа в выборке для сравнения
    y = x + len(ps)
    # выбираем последовательность символов из текста
    ps2 = txt[x:y]
    # сравниваем последовательность символов из текста с искомой подстрокой
    # если верно
    # присваиваем результирующей переменной значение индекса первого символа последовательности
    if ps2 == ps:
        result = x
        # прерываем цикл, так как нужно только первое вхождение
        break

# Выводим результат
print(result)