# Запрашиваем коэффициенты
print('Решение квадратного уравнения')
print('a * x^2 + b * x + c = 0')
a = float(input('Введите коэффициент a: '))
b = float(input('Введите коэффициент b: '))
c = float(input('Введите коэффициент c: '))

# Проверяем что это квадратное уравнение
if a == 0:
    print('Коэффициент a равен 0. Данное уравнение не является квадратным')
else:
    # Вычисляем дискриминант
    d = b**2 - 4*a*c
    #print(d)

    # Если дискриминант больше 0 - 2 корня
    if d > 0:
        print('Дискриминант больше ноля - уравнение имеет два корня.')
        x1 = (-b + d**0.5) / (2*a)
        print(f'Первый корень уравнения: {x1:.5f}')
        x2 = (-b - d**0.5) / (2*a)
        print(f'Второй корень уравнения: {x2:.5f}')
    # Если дискриминант равен 0 - 1 корень
    elif d == 0:
        print('Дискриминант равен нулю - уравнение имеет один корень.')
        x = -b / (2*a)
        print(f'Единственный корень уравнения: {x:.5f}')
    # Если дискриминант меньше 0 - решений нет
    elif d < 0:
        print('Дискриминант меньше ноля. Уравнение не имеет корней.')
